XML/Public/PMSQ03-KJ/request/body_PMSQ03-KJ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0><![CDATA[<MBS>
    <pub>
        <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
        <SRCBATCHNO>txbPMSQ03_KJ</SRCBATCHNO>
        <TRANSCODE>PMSQ03</TRANSCODE>
        <TRANSDATETIME>2020-07-29 13:41:11</TRANSDATETIME>
        <MD5>123456</MD5>
    </pub>
    <req>
        <head>
            <ALLAMOUNT>5932.32</ALLAMOUNT>
            <ALLCOUNT>1</ALLCOUNT>
        </head>
        <list>
            <detail>
            <SRCSERIALNO>testbPMSQ03_KJ</SRCSERIALNO>
            <SRCNOTECODE>testbPMSQ03_KJ1</SRCNOTECODE>
                <ORGCODE>001000</ORGCODE>
                <APPLYORGCODE>001000</APPLYORGCODE>
                <DEPTCODE/>
                <PAYDATE>2020-07-29</PAYDATE>
                <PAYTYPECODE>103</PAYTYPECODE>
                <SETTLEMENTMODECODE>101</SETTLEMENTMODECODE>
                <CAPITALCATEGORYCODE/>
                <BUDGETITEMCODE/>
                <ABSTRACTS/>
                <ISURGENT>0</ISURGENT>
                <PURPOSE/>
                <CHECKCODE/>
                <OFFICEPURPOSE/>
            <MEMO/>
                <OURORGCODE>001000</OURORGCODE>
                <OURBANKACCOUNTNUMBER/>
                <OURCURCODE>USD</OURCURCODE>
                <OURAMOUNT>5932.32</OURAMOUNT>
                <OPPOBJECTNAME>Teoh Leng Wah</OPPOBJECTNAME>
                <OPPOBJECTCODE>2002564</OPPOBJECTCODE>
                <OPPCOUNTERPARTYCATEGORYCODE/>
                <OPPBANKCODE/>
                <OPPBANKLOCATIONCODE/>
                <OPPBANKLOCATIONS>（韩国地区）中国银行股份有限公司九老分行</OPPBANKLOCATIONS>
                <OPPBANKACCOUNTNUMBER>018083808109</OPPBANKACCOUNTNUMBER>
                <OPPBANKACCOUNTNAME>Teoh Leng Wah</OPPBANKACCOUNTNAME>
                <OPPBANKAREACODE/>
                <OPPDIRECTCURCODE>USD</OPPDIRECTCURCODE>
                <CONTACTS/>
                <OPPCELLPHONE/>
                <OPPPRIVATEFLAG/>
                <OPPCERTTYPE/>
                <OPPCERTNUMBER/>
                <OPPEMAILADDRESS/>
                <OPPCARDTYPE/>
                <FUNDSPROPERTY>1</FUNDSPROPERTY>
                <changdetail>
                <OURREGORGCODE>001000</OURREGORGCODE>
                <OURORGTYPE>1</OURORGTYPE>
                <OURADDRESS/>
                <CASHBANKACCOUNTNUMBER/>
                <CASHBANKACCOUNTNAME/>
                <CASHAMOUNT>0</CASHAMOUNT>
                <PURCHASEBANKACCOUNTID/>
                <PURCHASEBANKACCOUNTNUMBER>1010101010</PURCHASEBANKACCOUNTNUMBER>
                <PURCHASEBANKACCOUNTNAME/>
                <PURCHASEAMOUNT>5932.32</PURCHASEAMOUNT>
                <OTHERBANKACCOUNTID/>
                <OTHERBANKACCOUNTNUMBER/>
                <OTHERBANKACCOUNTNAME/>
                <OTHERAMOUNT>0</OTHERAMOUNT>
                <OPPRESIDENTTYPE>FOR</OPPRESIDENTTYPE>
                <OPPCOUNTRYTYPE/>
                <OPPADDRESS> Huizhou City MY</OPPADDRESS>
                <OPPBRANCHSWIFTCODE>HMABMYKL</OPPBRANCHSWIFTCODE>
                <OPPBRANCHSWIFTNAME>HSBC AMANAH</OPPBRANCHSWIFTNAME>
                <OPPRESIDENTCOUNTRYID>MY</OPPRESIDENTCOUNTRYID>
                <OPPRESIDENTCOUNTRYCODE/>
                <OPPRESIDENTCOUNTRYNAME/>
                <OPPAGENTBANKID/>
                <OPPAGENTAREAID/>
                <OPPAGENTBANKLOCATIONID/>
                <OPPAGENTBRANCHSWIFTNAME/>
                <OPPAGENTBRANCHSWIFTCODE/>
                <OPPAGENTACCOUNTNUMBER/>
                <INTERMEDIATECOSTMODE>OUR</INTERMEDIATECOSTMODE>
                <PAYMENTMETHOD>A</PAYMENTMETHOD>
                <ISPAYMENTFORBONDEDGOOD>0</ISPAYMENTFORBONDEDGOOD>
                <PAYMENTPROPERTY>O</PAYMENTPROPERTY>
                <BUSINESSNUMBER/>
                <TRANSACTIONCODE1>622011</TRANSACTIONCODE1>
                <CURRENCYID1/>
                <CURRENCYCODE1/>
                <POSTSCRIPT1/>
                <AMOUNT1>5932.32</AMOUNT1>
                <TRANSACTIONCODE2/>
                <CURRENCYID2/>
                <CURRENCYCODE2/>
                <POSTSCRIPT2/>
                <AMOUNT2>0</AMOUNT2>
                <CONTRACTCODE/>
                <INVOICECODE/>
                <FEEBANKACCOUNTID/>
                <FEEBANKACCOUNTNUMBER>10000001</FEEBANKACCOUNTNUMBER>
                <CONTACTPERSON/>
                <CONTACTNUMBER/>
                <ISPAYMENTFORIMPORTITEM>0</ISPAYMENTFORIMPORTITEM>
                <ISDOMESTIC>0</ISDOMESTIC>
                <EXCHANGETYPECODE/>
                <TRANSACTIONCODE/>
                <EXCHANGECATEGORY/>
                <CREATEDBY>1686</CREATEDBY>
                <DESCRIPTION/>
                <OPPBRANCHRTGSCODE/>
                <OPPBRANCHRTGSNAME/>
                </changdetail>
            </detail>
        </list>
    </req>
</MBS>
 ]]></out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>